[{"name": "Стажер DevOps", "salary": "не указана", "url": "https://hh.ru/vacancy/85165686", "requirements": "Опыт написания Bash скриптов. Теоретические базовые знания linux систем. Знание <highlighttext>Python</highlighttext>3. Знание Git. Профильное образование IT-специальностей (оконченное, и..."}, {"name": "Data engineer", "salary": "не указана", "url": "https://www.superjob.ru/vakansii/data-engineer-47011454.html", "requirements": "SuperJob.ru — крупнейший российский интернет-сервис для поиска работы и сотрудников. Мы помогаем миллионам пользователей найти работу. \nЕжемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!» \n\nНаша цель — создать лучший продукт для каждого из наших пользователей. В этом нам помогает система, которая собирает данные из внутренних и внешних источников, а также из наших мобильных приложений. Ежедневно мы собираем и обрабатываем десятки миллионов событий от более чем миллиона пользователей, и это количество растет очень быстро.\nВ своей работе мы используем аналитическую базу данных ClickHouse, систему визуализации на базе Superset\\Metabase и множество других инструментов для работы с Big Data. В команду ищем человека, который поможет нам развивать эту систему.\nЧем придётся заниматься:\n• Работать с DWH, проектировать схемы для хранения данных.\n• Загружать данные из различных источников (как внутренних БД, так и внешних аналитических/маркетинговых платформ и т.д.) в DWH.\n• Разрабатывать, поддерживать и оптимизировать витрины данных.\n• Участвовать в организации CI/CD и мониторинга процессов обработки данных.\n• Искать ошибки и аномалии в данных, управлять качеством данных, автоматизировать проверку качества данных.\nЧто ждём от вас:\n• Уверенное знание SQL (аналитические функции, CTE, оптимизация запросов под Clickhouse и организация хранения данных в Clickhouse).\n• Хорошее знание Python (основные типы данных, основы ООП, основы алгоритмизации и взаимодействия с API).\n• Неудержимое желание обучаться и прокачиваться с нашей всевозможной поддержкой.\nБудет плюсом опыт работы с:\n• Большими объёмами данных.\n• ClickHouse cluster.\n• Linux, Docker, Jenkins/Airflow/Dagster.\n• CDC в Clickhouse через Kafka+Debezium.\n• Flask, SqlAlchemy.\nСвоему будущему коллеге мы предлагаем:\n• Работу в одном из самых быстрорастущих рынков - HRTech.\n• Высокую инженерную культуру.\n• Непрерывное обучение и профессиональное развитие внутри компании.\n\n• Возможность стать частью сплоченной команды, любящей свое дело.\n\n• Регулярную обратную связь от наставников и руководителей.\n\n• Официальную заработную плату.\n\n• ДМС после прохождения испытательного срока.\n\n• Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская. 3D-тур: public.superjob.ru/3dtour/ \n• Спортивный уголок.\n• Комфортную зону отдыха.\n• Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.\n• Оборудованное просторное место для питания.\n• Оплату проезда общественным транспортом."}, {"name": "Старший системный администратор", "salary": "не указана", "url": "https://krasnoyarsk.superjob.ru/vakansii/starshij-sistemnyj-administrator-47175353.html", "requirements": "Полюс Диджитал – бизнес-единица в группе одного из лидеров золотодобывающей отрасли мирового масштаба. Мы оказываем поддержку по IT-направлению 20 000 сотрудникам в 35-ти бизнес-единицах Группы Компаний «Полюс».\nИщем в команду Старшего специалиста под следующие задачи:\n• Выполнение запросов с соблюдением параметров уровня сервиса (Service Level Agreement, далее - SLA);\n• Планирование и изменение в информационно-технической инфраструктуре;\n• Обработка событий, поступающих от систем мониторинга;\n• Выполнение аварийно-восстановительных работ;\n• Решение задач уровня эксперта в своей зоне ответственности;\n• Создание и актуализация планов восстановления информационных систем в зоне ответственности;\n• Проведение регулярного тестирования планов восстановления информационных систем;\n• Анализ состояния ИТ инфраструктуры в зоне ответственности.\nИТ инфраструктура, входящая в зону ответственности:\n• Системы управления конфигурациями серверов Windows Server и рабочих мест Windows;\n• Системы управления конфигурациями серверов Linux;\n• Системы антивирусной защитой серверов, систем хранения данных (СХД) и рабочих мест;\n• Сетевое экранирование серверов и рабочих мест, встроенное в антивирусную защиту;\n• Системы защиты электронной почты;\n• Публикация приложений в Центре программного обеспечения;\n• Публикация новых версий операционных систем (ОС) и обновлений ОС и ПО Microsoft. \nТребования:\n• Эксперт в одной или нескольких ИТ инфраструктурах, указанных в зоне ответственности. \n• Опыт работы по обеспечению работоспособности серверной инфраструктуры от 2 лет с технологиями и решениями: Microsoft SCCM, Microsoft Endpoint Manager; \n• Опыт работы с системами управления конфигурациями SaltStack, Ansible; Kaspersky Security Center (KSC); Kaspersky Endpoint Security (KES), Kaspersky Security for Virtualization (KSVLA), Kaspersky Security for Windows Server (KSfWS), Kaspersky Security for Microsoft Exchange Servers; Kaspersky Scan Engine; \n• Желателен опыт работы с Kaspersky KICS, KSfMES, KATA, KEDR; серверные ОС Windows, Linux; \n• Желателен опыт автоматизации задач PowerShell, Python. \n\nУсловия:\n• Конкурентный уровень заработной платы (оклад + годовой бонус);\n\n• Удаленный формат работы или комфортный офис (ортопедическая мебель, мягкие переговорные комнаты, оборудованная кофемашиной, чаем и посудой кухня, настольный теннис и т.д.);\n\n• Высокоразвитая корпоративная культура (здоровье, личностное развитие, самообразование, досуг);\n\n• Поддержка сотрудника и семьи в различных жизненных ситуациях;\n\n• Трудоустройство по ТК РФ, полис ДМС, компенсация проезда в отпуск, обеспечение питанием, корпоративная мобильная связь и т.д.\n\n• График: 5/2, пятница - сокращенный рабочий день."}, {"name": "Учитель информатики", "salary": "не указана", "url": "https://www.superjob.ru/vakansii/uchitel-informatiki-34123084.html", "requirements": "Обязанности:\n• \nРазработка рабочей программы по предмету. \n• \nОрганизация учебной деятельности обучающихся на уроке и во внеурочное время. \n• \nВедение электронного журнала\nТребования:\n• Высшее образование\n• стаж работы от 6 лет\n• опыт преподавания информатики углубленного уровня сложности в проектах ДОНМ \"ИТ-класс в московской школе\"; \"Инженерный класс в московской школе\";\n• результат прохождения учителем независимой диагностики в ЦНД МЦКО на уровень не ниже высокого\n• результативность подготовки к ОГЭ, ЕГЭ\n• Программирование: Перволого/Логомиры, Scratch, Кумир, Паскаль/Дельфи, Alice/Greenfoot/Java, C/C++, Python\n САПР: Компас\n Веб-дизайн и разработка: HTML5, CSS3, JavaScript, JQuery, PHP, Adobe Photoshop, Dreamweaver, Flash, AJAX\n СУБД: SQL (Oracle APEX), MySQL\n Администрирование: Windows, Linux, Cisco \n\nУсловия:\nШкола на протяжении ряда лет входит в 50 лучших школ по итогам рейтинга вклада ОО в качественное образование московских школьников; по итогам 2021-2022 уч.года школа удостоена Гранта Мэра 2 степени за достижение высоких результатов образовательной деятельности.\nШкола участвует в проектах ДОНМ \"ИТ-класс в московской школе\" (направление - программирование); \"Инженерный класс в московской школе\"."}, {"name": "DevOps Engineer", "salary": "не указана", "url": "https://www.superjob.ru/vakansii/devops-engineer-34424249.html", "requirements": "SuperJob — это инновационная IT-компания, которая помогает соискателям найти работу, а работодателям — приобрести ценного сотрудника.\nЕжемесячно нашим сервисом пользуются миллионы соискателей и десятки тысяч работодателей, среди которых РЖД, Мегафон, МТС, Леруа Мерлен, Почта России, Сбербанк, Альфа-Банк, Ригла и многие другие. Мы активно развиваем нашу платформу и делаем ее лучше, подтверждая миссию «Работа должна доставлять удовольствие!»\nМы ожидаем от кандидата опыт:\n• Администрирования Linux.\n• Настройки и эксплуатации CI/CD.\n• Программирования (скрипты Bash/PHP/Python/Go).\n• Настройки и эксплуатации web-проектов.\n• Использования систем мониторинга.\nЧем предстоит заниматься:\n• Управлять мониторингом zabbix, grafana.\n• Создавать и развивать собственные инструменты мониторинга и профайлинга для внутренних сервисов (php, nodejs) и для используемого стороннего ПО.\n• Реагировать на инциденты, не теряя присутствия духа.\n• Поддерживать актуальный план восстановления в случае сбоев.\n• Проводить нагрузочное тестирование новых сервисов, новых версий и новых конфигураций для mariadb и других серверов.\n• Находить узкие места в архитектуре проекта и приложений.\n• Рулить конфигурацией сервисов nginx, mariadb, clickhouse, apache, rabbitmq и других.\n• Писать плейбуки и роли для ansible для конфигурации и деплоя.\n• Контейнеризировать новые сервисы и поддерживать старые.\n• Поддерживать стороннее ПО (sentry, testrail, confluence, jira, bitbucket, teamcity).\n• Рулить процессом continuous integration и deployment.\nБудет плюсом опыт:\n• Администрирования систем виртуализации.\n• Администрирования баз данных SQL, NoSQL.\n• Администрирования высоконагруженного web-проекта.\nМы используем в работе свой дата-центр, пару сотен серверов, CentOs/Virtuozzo, Git, Nginx, Apache, NodeJS, Bash/Sh, PHP, Python, Rust, Go, MariaDB/MySql, PostgreSQL, Redis, Sphinx, RabbitMQ, Memcache, ClickHouse, ELK, Graphite/Grafana, Zabbix, TeamCity, Jenkins, Docker, Ansible, Nexus, Vault, Atlassian Jira/Confluence/BitBucket.\nСвоему будущему коллеге мы предлагаем:\n• Работу в одном из самых быстрорастущих рынков - HRTech.\n\n• Высокую инженерную культуру.\n\n• Непрерывное обучение и профессиональное развитие внутри компании.\n\n• Возможность стать частью сплоченной команды, любящей свое дело.\n\n• Регулярную обратную связь от наставников и руководителей.\n\n• Официальную заработную плату.\n\n• ДМС после прохождения испытательного срока.\n\n• Современный офис в 10 минутах пешей прогулки от станций метро Пушкинская/Маяковская/Чеховская/Новослободская.\n\n• Спортивный уголок.\n\n• Комфортную зону отдыха.\n\n• Кофе-поинты с вкуснейшим кофе и вендинговым аппаратом.\n\n• Оборудованное просторное место для питания.\n\n• Оплату проезда общественным транспортом."}, {"name": "Инженер-оператор БПЛА", "salary": "80000-120000 rub", "url": "https://www.superjob.ru/vakansii/inzhener-operator-bpla-47013553.html", "requirements": "Вакансия компании ООО \"ПРОМ КОМПОЗИТ\"\nООО «Пром Композит» - компания, специализирующаяся на проектировании и производстве изделий из композиционных материалов горячим формованием и изготовлении оснастки, в том числе с применением метода вакуумной инфузии.\nКомпания является дочерним предприятием второго порядка АО «ВКО «Алмаз-Антей».\nСерийная и опытная продукция ООО «Пром Композит» успешно применяется в различных областях народного хозяйства: радиоэлектронике, самолетостроении, кораблестроении, автомобилестроении и пр.\nОбязанности:\n• Управление, сборка, настройка БПЛА мультироторного типа.\nТребования:\nБазовые навыки:\n• Уверенные навыки пилотирования БПЛА. В приоритете навыки и опыт работы с большими коммерческими дронами, построенными на базе ArduPilot, DJI и подобных экосистем;\n• Знания общих принципов организации бортовой электроники (организация цепей питания, протоколы взаимодействия отдельных элементов системы, понимание азов электромагнитной совместимости, настройка полетного контроллера);\n• Умение определять требования для отдельных компонентов БПЛА в зависимости от заданной грузоподъемности и полезной нагрузки;\n• Базовые знания радиоэлектроники;\n• Знание современных стандартов связи, используемых при построении БПЛА, умение грамотно расположить и настроить антенные системы на борту БПЛА и на земле;\n• Способность понимать, учиться и разбираться, так как подразумевается работа с полетными контроллерами, оснащенными пользовательским программным обеспечением, находящимся в стадии отладки;\n• Хорошие навыки радиомонтажа.\nПлюсом будет:\n• Опыт 3d-моделирования в САПР SolidWorks, Компас или иных САПР;\n• Опыт 3d-печати, знание азов настройки и обслуживания 3d-принтеров;\n• Навыки работы с командной строкой в Windows и Linux;\n• Опыт работы с одноплатными компьютерами;\n• Программирование на языках Python и C++ (работа с машинным зрением и сетевыми протоколами, разработка технологических графических интерфейсов) изделий.\nУсловия:\n• Полный рабочий день, график работы с 9 до 18, перерыв на обед с 12 до 13;\n• Работа на территории ЛЭМЗ (Лианозовский Электромеханический Завод);\n• Испытательный срок - 2 месяца;\n• Трудоустройство по ТК РФ."}, {"name": "Аналитик данных/Data Analyst (Удаленно)", "salary": "80000-120000 RUR", "url": "https://hh.ru/vacancy/85265442", "requirements": "Опыт работы в среде Linux. Опыт работы с bash. Умение работать с удаленными серверами через SSH. Опыт работы с git. "}, {"name": "Сетевой инженер", "salary": "70000-100000 rub", "url": "https://spb.superjob.ru/vakansii/setevoj-inzhener-46941423.html", "requirements": "Обязанности: \n• Общение с клиентом, решение заявок клиентов по вопросу работы Интернет и каналов.\n \n• Обеспечение своевременной диагностики и устранения неисправностей в сети.\n \n• Поддержка актуальности схемы сети, настроек на сетевом оборудовании.\n \n• Администрирование linux серверов.\n \n• Мониторинг состояния и настройка сетевого оборудования, UPS (Cisco, D-Link, Huawei, Mikrotik, EATON, APC).\n \nТребования: \n• Высшее техническое образование\n \n• Уверенное знание компьютерных сетей: сети ethernet, Vlan, QinQ, L3, модели ISO/OSI (знание консоли cisco будет плюсом\n \n• Уверенное знание Linux и его сервисов (Bind, Apache и так далее)\n \n• Знание средств мониторинга сети и серверов на основе Linux, cacti\n \n• Базовое программирование на bash, python, PHP\n \n• Английский язык (технический)\n \nУсловия: \n• Работа в офисе, 5/2 с 8:00 до 16:30\n \n• \nОт 70000 рублей на руки, по результатам собеседования.\n \n• Срочный договор: 3 мес. испытательный срок, далее бессрочный договор.\n \n• ДМС после испытательный срока"}, {"name": "Программист", "salary": "60000+ rub", "url": "https://kolomna.superjob.ru/vakansii/programmist-45594068.html", "requirements": "Обязанности:\n• Реализация алгоритмов и структур данных для решения задач\n• организации. Разработка веб-сервисов, системных утилит, систем\n• автоматизации. Осуществление технической поддержки сотрудников. \nТребования:\n• Высшее техническое образование. Уверенное знание и опыт\n• разработки на Python 3, JS, PostgreSQL. Опыт работы с Linux на уровне\n• администратора. \n• Знание современных информационных и сетевых технологий.\n• Готовность работать в режиме многозадачности. \nУсловия:\n• 40-часовая р/неделя, 8-часовой р/день, с 8.00 до 17.00, выходной - суббота, воскресенье\n• Удалённая работа не рассматривается"}, {"name": "Главный специалист Отдела программой эксплуатации", "salary": "50000+ rub", "url": "https://izhevsk.superjob.ru/vakansii/glavnyj-specialist-otdela-programmoj-ekspluatacii-43163788.html", "requirements": "Обязанности:\n- Описание процессов и сценариев работы информационных систем;\n- Подготовка технических регламентов по работе с программными продуктами;\n- Создание технической документации;\n- Участие в функциональном и интеграционном тестировании и приемо-сдаточных испытаниях;\n- Аудит баз данных информационной системы СФР (проверка, сверка, сравнительный анализ БД);\n- Разработка программного обеспечения на Python, PHP, HTML, java-script, SQL, java;\n- Техническая поддержка пользователей\nТребования:\nВысшее профильное образование;\nЗнание и опыт администрирования современных операционных систем от 3 лет, в том числе Linux-систем (в приоритете - RedHat);\nЗнание языков программирования, в приоритете Python, PHP\nРабота с БД, знание SQL\nУверенные знания продуктов MS Office (в особенности Excel на уровне чтения/написания макросов на VBA, формул и работа со сводными таблицами, а так же PowerPoint)\nАналитический склад ума и высокая скорость мышления\nУмение анализировать запросы в базах, готовить письменные критические замечания для дальнейшей оптимизации структуры соответствующих баз данных и используемых запросов\nПросьба: резюме направлять на почту Кузьминой Светлане\nУсловия:\n- стабильная зарплата (2 раза в месяц) + премии;\n- оформление, отпуск, больничный и пр. - по ТК РФ;\n- дополнительный ежегодный отпуск в количестве 10 дней;\n- возможность быстрого профессионального и карьерного роста;\n- отличная материальная база для профессионального развития;\n- возможность обучения за счет работодателя."}]